# Exo with DataFrame and Series

In [24]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]})

   A  B
0  1  5
1  2  6
2  3  7
3  4  9

In [27]:
pd.Series([11, 92, 63, 34])

0    11
1    92
2    63
3    34
dtype: int64

In [28]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]}) / pd.Series([11, 92, 63, 34])

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [30]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]}) + pd.Series([11, 92, 63, 34])

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [39]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]}).add( pd.Series([11, 92, 63, 34]), axis = "rows")

    A   B
0  12  16
1  94  98
2  66  70
3  38  43

In [32]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]}) + 11

    A   B
0  12  16
1  13  17
2  14  18
3  15  20

In [29]:
pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 9]}).divide(pd.Series([11, 92, 63, 34]), axis = "rows")

          A         B
0  0.090909  0.454545
1  0.021739  0.065217
2  0.047619  0.111111
3  0.117647  0.264706